Repository: n7tae/mvoice
Catalog: po/*.po
Languages: it

source: About MVoice
it: Informazioni su MVoice

source: Save
it: Salva

source: Delete
it: Elimina

source: Destination
it: Destinazione

source: %s: couldn't decode image
it: %s: impossibile decodificare l'immagine

source: Settings...
it: Impostazioni...

source: About...
it: Informazioni...

source: Destination Callsign:
it: Nominativo destinatario:

source: A reflector or user callsign
it: Il nominativo di un utente o di un reflector

source: The IP of the reflector or user
it: L'IP di un utente o di un reflector

source: Port:
it: Porta:

source: The comm port of the reflector or user
it: La porta di comunicazione di un utente o di un reflector

source: Module:
it: Modulo:

source: Select a module for the reflector or repeater
it: Selezionare un modulo per il reflector o ripetitore

source: Update or delete an existing contact, or save a new contact
it: Aggiorna o elimina un contatto esistente o salva un nuovo contatto

source: Open Dashboard
it: Apri dashboard

source: Open a reflector dashboard, if available
it: Apre il dashboard di un reflector, se disponibile

source: Connect
it: Connetti

source: Connect to an M17 Reflector
it: Connette a un reflector M17

source: Disconnect
it: Disconnetti

source: Disconnected from a reflector
it: Disconnesso da un reflector

source: Echo Test
it: Test eco

source: Push to record a test that will be played back
it: Premere per registrare una prova che verrà riprodotta

source: Push to talk. This is actually a toggle button
it: Push to talk. In realtà questo è un interruttore

source: Quick Key
it: Tasto veloce

source: Send a short, silent voice stream
it: Invia un breve flusso vocale silenzioso

source: %s Time=%.1fs Vol=%.0fdB Clip=%.0f%%
it: %s Tempo=%.1fs Vol=%.0fdB Clip=%.0f%%

source: Echo
it: Eco

source: RX Audio
it: Ricezione audio

source: ERROR: Your system is not yet configured!
it: ERRORE: Il sistema non è ancora configurato!

source: Be sure to save your callsign and internet access in Settings
it: Assicurarsi di salvare il nominativo e l'accesso a internet nelle impostazioni

source: You can usually leave the audio devices as 'default'
it: Solitamente si può lasciare i dispositivi audio come "default"

source: not found
it: non trovato

source: Settings
it: Impostazioni

source: Station
it: Stazione

source: My Callsign:
it: Mio nominativo:

source: Input your callsign, up to 8 characters
it: Inserire il nominativo, fino a 8 caratteri

source: Using Module:
it: Modulo in uso:

source: Assign the transceiver module
it: Assegna il modulo del transceiver

source: Voice-only
it: Solo voce

source: This is the higher quality, 3200 bits/s codec
it: Questo è il codec con qualità più alta, 3200 bit/s

source: Voice+Data
it: Voce+dati

source: This is the 1600 bits/s codec
it: Questo è il codec a 1600 bit/s

source: Network
it: Rete

source: IPv4 Only
it: Solo IPv4

source: IPv6 Only
it: Solo IPv6

source: DHT Bootstrap:
it: Avvio DHT:

source: An existing node on the DHT Network
it: Un nodo esistente sulla rete DHT

source: Select the audio Input device
it: Scegliere il dispositivo audio di ingresso

source: Input:
it: Ingresso:

source: Select your audio input device, usually "default"
it: Scegliere il dispositivo audio di ingresso, solitamente "default"

source: Output:
it: Uscita:

source: Select the audio output device, usually "default"
it: Scegliere il dispositivo audio di uscita, solitamente "default"

source: Rescan
it: Aggiorna

source: Rescan for new audio devices
it: Aggiorna l'elenco dei dispositivi audio

source: Update
it: Aggiorna

source: ERROR
it: ERRORE

source: ERROR: unexpected IOID=
it: ERRORE: unexpected IOID=

source: MVoice version # %s
it: MVoice versione %s

source: Action
it: Azione

source: Copyright (c) 2022 by Thomas A. Early N7TAE
it: Copyright © 2022 Thomas A. Early N7TAE

source: Disconnect from an M17 reflector
it: Disconnette da un reflector M17

source: Select the audio Input and Output devices
it: Scegliere il dispositivo audio di ingresso e di uscita
